hpmicro/hpm_sdk/soc/HPM6830/HPM6830_svd.xml
        <register>
          <name>ODTCFG</name>
          <description>Description: ODT Configuration Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0x04000400</resetValue>
          <resetMask>0x0F1F0F7C</resetMask>
          <fields>
            <field>
              <name>WR_ODT_HOLD</name>
              <description>Description: Cycles to hold ODT for a write command. The minimum supported value is 2. DDR2/DDR3/DDR4
BL8 - 0x6
BL4 - 0x4
LPDDR3 - RU(tDQSSmax/tCK) + 4
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ODT_DELAY</name>
              <description>Description: The delay, in clock cycles, from issuing a write command to setting ODT values associated with that command. ODT setting must remain constant for the entire time that DQS is driven by the uMCTL2. ODT is used only in DDR2, DDR3, DDR4 and LPDDR3 designs.
Recommended values:
DDR2
If (CWL + AL &lt; 3), then 0.
If (CWL + AL &gt;= 3), then (CWL + AL - 3) DDR3 - 0
DDR4 - DFITMG1.dfi_t_cmd_lat (to adjust for CAL mode)
LPDDR3 - (CWL - RU(tODToffmax/tCK))
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_ODT_HOLD</name>
              <description>Description: Cycles to hold ODT for a read command. The minimum supported value is 2. Recommended values: DDR2/DDR3
BL8 - 0x6
BL4 - 0x4
DDR4 - 0x6, but needs to be reduced to 0x5 in CAL mode to avoid overlap of read and write ODT LPDDR3 - RU(tDQSCKmax/tCK) + 4 + 1
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_ODT_DELAY</name>
              <description>Description: The delay, in clock cycles, from issuing a read command to setting ODT values associated with that command. ODT setting must remain constant for the entire time that DQS is driven by the uMCTL2. ODT is used only in DDR2, DDR3, DDR4 and LPDDR3 designs.
Recommended values:
DDR2
If (CL + AL &lt; 4), then 0.
If (CL + AL &gt;= 4), then (CL + AL - 4) DDR3
(CL - CWL) DDR4
If CAL mode is enabled, CL - CWL + DFITMG1.dfi_t_cmd_lat
If CAL mode is not enabled, CL - CWL -1, or 0 if CL - CWL &lt; 1
LPDDR3, MEMC_FREQ_RATIO=2
CL - RU(tODToffmax/tCK)) Value After Reset: 0x0 Exists: Always</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODTMAP</name>
          <description>Description: ODT/Rank Map Register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0x00002211</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RANK1_RD_ODT</name>
              <description>Description: Indicates which remote ODTs must be turned on during a read from rank 1.
Each rank has a remote ODT (in the SDRAM) which can be turned on by setting the appropriate bit here.
Rank 0 is controlled by the LSB; rank 1 is controlled by bit next to the LSB, etc.
For each rank, set its bit to 1 to enable its ODT.
Present only in configurations that have 2 or more ranks Value After Reset: "(MEMC_NUM_RANKS&gt;1) ? 0x2 : 0x0" Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANK1_WR_ODT</name>
              <description>Description: Indicates which remote ODTs must be turned on during a write to rank 1.
Each rank has a remote ODT (in the SDRAM) which can be turned on by setting the appropriate bit here.
Rank 0 is controlled by the LSB; rank 1 is controlled by bit next to the LSB, etc.
For each rank, set its bit to 1 to enable its ODT.
Present only in configurations that have 2 or more ranks Value After Reset: "(MEMC_NUM_RANKS&gt;1) ? 0x2 : 0x0" Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANK0_RD_ODT</name>
              <description>Description: Indicates which remote ODTs must be turned on during a read from rank 0.
Each rank has a remote ODT (in the SDRAM) which can be turned on by setting the appropriate bit here.
Rank 0 is controlled by the LSB; rank 1 is controlled by bit next to the LSB, etc.
For each rank, set its bit to 1 to enable its ODT.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANK0_WR_ODT</name>
              <description>Description: Indicates which remote ODTs must be turned on during a write to rank 0.
Each rank has a remote ODT (in the SDRAM) which can be turned on by setting the appropriate bit here.
Rank 0 is controlled by the LSB; rank 1 is controlled by bit next to the LSB, etc.
For each rank, set its bit to 1 to enable its ODT.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED</name>
          <description>Description: Scheduler Control Register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0x00000805</resetValue>
          <resetMask>0x7FFF3F07</resetMask>
          <fields>
            <field>
              <name>RDWR_IDLE_GAP</name>
              <description>Description: When the preferred transaction store is empty for these many clock cycles, switch to the alternate transaction store if it is non-empty.
The read transaction store (both high and low priority) is the default preferred transaction store and the write transaction store is the alternative store.
When prefer write over read is set this is reversed.
0x0 is a legal value for this register. When set to 0x0, the transaction store switching will happen immediately when the switching conditions become true.
FOR PERFORMANCE ONLY
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GO2CRITICAL_HYSTERESIS</name>
              <description>Description: UNUSED Value After Reset: 0x0 Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPR_NUM_ENTRIES</name>
              <description>Description: Number of entries in the low priority transaction store is this value + 1.
(MEMC_NO_OF_ENTRY - (SCHED.lpr_num_entries + 1)) is the number of entries available for the high priority transaction store.
Setting this to maximum value allocates all entries to low priority transaction store.
Setting this to 0 allocates 1 entry to low priority transaction store and the rest to high priority transaction store.
Note: In ECC configurations, the numbers of write and low priority read credits issued is one less than in the non-ECC case. One entry each is reserved in the write and low- priority read CAMs for storing the RMW requests arising out of single bit error correction RMW operation.
Value After Reset: "MEMC_NO_OF_ENTRY/2"
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGECLOSE</name>
              <description>Description: If true, bank is kept open only until there are page hit transactions available in the CAM to that bank. The last read or write command in the CAM with a bank and page hit will be executed with auto-precharge if SCHED1.pageclose_timer=0. Even if this register set to 1 and SCHED1.pageclose_timer is set to 0, explicit precharge (and not auto-precharge) may be issued in some cases where there is a mode switch between Write and Read or between LPR and HPR. The Read and Write commands that are executed as part of the ECC scrub requests are also executed without auto-precharge. If false, the bank remains open until there is a need to close it (to open a different page, or for page timeout or refresh timeout) - also known as open page policy. The open page policy can be overridden by setting the per-command-autopre bit on the HIF interface (co_ih_rxcmd_autopre).
The pageclose feature provids a midway between Open and Close page policies.
FOR PERFORMANCE ONLY.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFER_WRITE</name>
              <description>Description: If set then the bank selector prefers writes over reads.
FOR DEBUG ONLY.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_LOW_PRI_N</name>
              <description>Description: Active low signal. When asserted ('0'), all incoming transactions are forced to low priority. This implies that all High Priority Read (HPR) and Variable Priority Read commands (VPR) will be treated as Low Priority Read (LPR) commands. On the write side, all Variable Priority Write (VPW) commands will be treated as Normal Priority Write (NPW) commands. Forcing the incoming transactions to low priority implicitly turns off Bypass path for read commands.
FOR PERFORMANCE ONLY.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCHED1</name>
          <description>Description: Scheduler Control Register 1</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PAGECLOSE_TIMER</name>
              <description>Description: This field works in conjunction with SCHED.pageclose. It only has meaning if SCHED.pageclose==1.
If SCHED.pageclose==1 and pageclose_timer==0, then an auto-precharge may be scheduled for last read or write command in the CAM with a bank and page hit. Note, sometimes an explicit precharge is scheduled instead of the auto-precharge. See SCHED.pageclose for details of when this may happen.
If SCHED.pageclose==1 and pageclose_timer&gt;0, then an auto-precharge is not scheduled for last read or write command in the CAM with a bank and page hit. Instead, a timer is started, with pageclose_timer as the initial value. There is a timer on a per bank basis. The timer decrements unless the next read or write in the CAM to a bank is a page hit. It gets reset to pageclose_timer value if the next read or write in the CAM to a bank is a page hit. Once the timer has reached zero, an explcit precharge will be attempted to be scheduled.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFHPR1</name>
          <description>Description: High Priority Read CAM Register 1</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0x0F000001</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <fields>
            <field>
              <name>HPR_XACT_RUN_LENGTH</name>
              <description>Description: Number of transactions that are serviced once the HPR queue goes critical is the smaller of:
This number
Number of transactions available Unit: Transaction.
FOR PERFORMANCE ONLY.
Value After Reset: 0xf
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPR_MAX_STARVE</name>
              <description>Description: Number of clocks that the HPR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 will disable the starvation functionality; during normal operation, this function should not be disabled as it will cause excessive latencies.
Unit: Clock cycles.
FOR PERFORMANCE ONLY.
Value After Reset: 0x1
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFLPR1</name>
          <description>Description: Low Priority Read CAM Register 1</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0x0F00007F</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <fields>
            <field>
              <name>LPR_XACT_RUN_LENGTH</name>
              <description>Description: Number of transactions that are serviced once the LPR queue goes critical is the smaller of:
This number
Number of transactions available. Unit: Transaction.
FOR PERFORMANCE ONLY.
Value After Reset: 0xf
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPR_MAX_STARVE</name>
              <description>Description: Number of clocks that the LPR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 will disable the starvation functionality; during normal operation, this function should not be disabled as it will cause excessive latencies.
Unit: Clock cycles.
FOR PERFORMANCE ONLY.
Value After Reset: 0x7f
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFWR1</name>
          <description>Description: Write CAM Register 1</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0x0F00007F</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <fields>
            <field>
              <name>W_XACT_RUN_LENGTH</name>
              <description>Description: Number of transactions that are serviced once the WR queue goes critical is the smaller of:
This number
Number of transactions available. Unit: Transaction.
FOR PERFORMANCE ONLY.
Value After Reset: 0xf
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>W_MAX_STARVE</name>
              <description>Description: Number of clocks that the WR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 will disable the starvation functionality; during normal operation, this function should not be disabled as it will cause excessive latencies.
Unit: Clock cycles.
FOR PERFORMANCE ONLY.
Value After Reset: 0x7f
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFVPR1</name>
          <description>Description: Variable Priority Read CAM Register 1</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>VPR_TIMEOUT_RANGE</name>
              <description>Description: Indicates the range of the timeout value that is used for grouping the expired VPR commands in the CAM in DDRC. For example, if the register value is set to 0xF, then the priorities of all the VPR commands whose timeout counters are 15 or below will be considered as expired-VPR commands when the timeout value of any of the VPR commands reach 0. The expired-VPR commands, when present, are given higher priority than HPR commands. The VPR commands are expected to consist of largely page hit traffic and by grouping them together the bus utilization is expected to increase. This register applies to transactions inside the DDRC only.
The Max value for this register is 0x7FF and the Min value is 0x0.
When programmed to the Max value of 0x7FF, all the VPR commands that come in to DDRC will time-out right-away and will be considered as expired-VPR.
When programmed to the Min value of 0x0, the timer of each command would have to reach a value of 0 before it will be considered as expired-VPR.
Unit: Clock cycles.
FOR PERFORMANCE ONLY.
Value After Reset: 0x0
Exists: UMCTL2_VPR_EN==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFVPW1</name>
          <description>Description: Variable Priority Write CAM Register 1</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>VPW_TIMEOUT_RANGE</name>
              <description>Description: Indicates the range of the timeout value that is used for grouping the expired VPW commands in the CAM in DDRC. For example, if the register value is set to 0xF, then the priorities of all the VPW commands whose timeout counters are 15 or below will be considered as expired-VPW commands when the timeout value of any of the VPW commands reach 0. The expired-VPW commands, when present, are given higher priority than normal Write commands. The VPW commands are expected to consist of largely page hit traffic and by grouping them together the bus utilization is expected to increase. This register applies to transactions inside the DDRC only.
The Max value for this register is 0x7FF and the Min value is 0x0.
When programmed to the Max value of 0x7FF, all the VPW commands that come in to DDRC will time-out right-away and will be considered as expired-VPW.
When programmed to the Min value of 0x0, the timer of each command would have to reach a value of 0 before it will be considered as expired-VPW.
Unit: Clock cycles.
FOR PERFORMANCE ONLY.
Value After Reset: 0x0
Exists: UMCTL2_VPW_EN==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG0</name>
          <description>Description: Debug Register 0</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000017</resetMask>
          <fields>
            <field>
              <name>DIS_COLLISION_PAGE_OPT</name>
              <description>Description: When this is set to '0', auto-precharge is disabled for the flushed command in a collision case. Collision cases are write followed by read to same address, read followed by write to same address, or write followed by write to same address with DBG0.dis_wc bit = 1 (where same address comparisons exclude the two address bits representing critical word).
FOR DEBUG ONLY.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_ACT_BYPASS</name>
              <description>Description: Only present in designs supporting activate bypass.
When 1, disable bypass path for high priority read activates FOR DEBUG ONLY.
Value After Reset: 0x0
Exists: MEMC_BYPASS==1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_RD_BYPASS</name>
              <description>Description: Only present in designs supporting read bypass.
When 1, disable bypass path for high priority read page hits FOR DEBUG ONLY.
Value After Reset: 0x0
Exists: MEMC_BYPASS==1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_WC</name>
              <description>Description: When 1, disable write combine. FOR DEBUG ONLY
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
