hpmicro/hpm_sdk/soc/HPM6830/HPM6830_svd.xml
        <register>
          <name>PSTAT</name>
          <description>Description: Port Status Register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WR_PORT_BUSY_15</name>
              <description>Description: Indicates if there are outstanding writes for port 15.
Value After Reset: 0x0
Exists: UMCTL2_PORT_15==1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_14</name>
              <description>Description: Indicates if there are outstanding writes for port 14.
Value After Reset: 0x0
Exists: UMCTL2_PORT_14==1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_13</name>
              <description>Description: Indicates if there are outstanding writes for port 13.
Value After Reset: 0x0
Exists: UMCTL2_PORT_13==1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_12</name>
              <description>Description: Indicates if there are outstanding writes for port 12.
Value After Reset: 0x0
Exists: UMCTL2_PORT_12==1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_11</name>
              <description>Description: Indicates if there are outstanding writes for port 11.
Value After Reset: 0x0
Exists: UMCTL2_PORT_11==1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_10</name>
              <description>Description: Indicates if there are outstanding writes for port 10.
Value After Reset: 0x0
Exists: UMCTL2_PORT_10==1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_9</name>
              <description>Description: Indicates if there are outstanding writes for port 9.
Value After Reset: 0x0
Exists: UMCTL2_PORT_9==1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_8</name>
              <description>Description: Indicates if there are outstanding writes for port 8.
Value After Reset: 0x0
Exists: UMCTL2_PORT_8==1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_7</name>
              <description>Description: Indicates if there are outstanding writes for port 7.
Value After Reset: 0x0
Exists: UMCTL2_PORT_7==1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_6</name>
              <description>Description: Indicates if there are outstanding writes for port 6.
Value After Reset: 0x0
Exists: UMCTL2_PORT_6==1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_5</name>
              <description>Description: Indicates if there are outstanding writes for port 5.
Value After Reset: 0x0
Exists: UMCTL2_PORT_5==1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_4</name>
              <description>Description: Indicates if there are outstanding writes for port 4.
Value After Reset: 0x0
Exists: UMCTL2_PORT_4==1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_3</name>
              <description>Description: Indicates if there are outstanding writes for port 3.
Value After Reset: 0x0
Exists: UMCTL2_PORT_3==1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_2</name>
              <description>Description: Indicates if there are outstanding writes for port 2.
Value After Reset: 0x0
Exists: UMCTL2_PORT_2==1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_1</name>
              <description>Description: Indicates if there are outstanding writes for port 1.
Value After Reset: 0x0
Exists: UMCTL2_PORT_1==1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_PORT_BUSY_0</name>
              <description>Description: Indicates if there are outstanding writes for port 0.
Value After Reset: 0x0
Exists: UMCTL2_PORT_0==1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_15</name>
              <description>Description: Indicates if there are outstanding reads for port 15.
Value After Reset: 0x0
Exists: UMCTL2_PORT_15==1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_14</name>
              <description>Description: Indicates if there are outstanding reads for port 14.
Value After Reset: 0x0
Exists: UMCTL2_PORT_14==1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_13</name>
              <description>Description: Indicates if there are outstanding reads for port 13.
Value After Reset: 0x0
Exists: UMCTL2_PORT_13==1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_12</name>
              <description>Description: Indicates if there are outstanding reads for port 12.
Value After Reset: 0x0
Exists: UMCTL2_PORT_12==1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_11</name>
              <description>Description: Indicates if there are outstanding reads for port 11.
Value After Reset: 0x0
Exists: UMCTL2_PORT_11==1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_10</name>
              <description>Description: Indicates if there are outstanding reads for port 10.
Value After Reset: 0x0
Exists: UMCTL2_PORT_10==1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_9</name>
              <description>Description: Indicates if there are outstanding reads for port 9.
Value After Reset: 0x0
Exists: UMCTL2_PORT_9==1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_8</name>
              <description>Description: Indicates if there are outstanding reads for port 8.
Value After Reset: 0x0
Exists: UMCTL2_PORT_8==1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_7</name>
              <description>Description: Indicates if there are outstanding reads for port 7.
Value After Reset: 0x0
Exists: UMCTL2_PORT_7==1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_6</name>
              <description>Description: Indicates if there are outstanding reads for port 6.
Value After Reset: 0x0
Exists: UMCTL2_PORT_6==1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_5</name>
              <description>Description: Indicates if there are outstanding reads for port 5.
Value After Reset: 0x0
Exists: UMCTL2_PORT_5==1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_4</name>
              <description>Description: Indicates if there are outstanding reads for port 4.
Value After Reset: 0x0
Exists: UMCTL2_PORT_4==1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_3</name>
              <description>Description: Indicates if there are outstanding reads for port 3.
Value After Reset: 0x0
Exists: UMCTL2_PORT_3==1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_2</name>
              <description>Description: Indicates if there are outstanding reads for port 2.
Value After Reset: 0x0
Exists: UMCTL2_PORT_2==1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_1</name>
              <description>Description: Indicates if there are outstanding reads for port 1.
Value After Reset: 0x0
Exists: UMCTL2_PORT_1==1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_PORT_BUSY_0</name>
              <description>Description: Indicates if there are outstanding reads for port 0.
Value After Reset: 0x0
Exists: UMCTL2_PORT_0==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCFG</name>
          <description>Description: Port Common Configuration Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>
          <fields>
            <field>
              <name>PAGEMATCH_LIMIT</name>
              <description>Description: Page match four limit. If set to 1, limits the number of consecutive same page DDRC transactions that can be granted by the Port Arbiter to four when Page Match feature is enabled.	If set to 0, there is no limit imposed on number of consecutive same page DDRC transactions.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GO2CRITICAL_EN</name>
              <description>Description: If set to 1 (enabled), sets co_gs_go2critical_wr and co_gs_go2critical_rd signals going to DDRC based on urgent input (awurgent, arurgent) coming from AXI master. If set to 0 (disabled), co_gs_go2critical_wr and co_gs_go2critical_rd signals at DDRC are driven to 1b'0.
Value After Reset: 0x0
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0xb0</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
          <name>PCFG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>R</name>
            <description>Description: Port n Configuration Read Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00004000</resetValue>
            <resetMask>0x000073FF</resetMask>
            <fields>
              <field>
                <name>RD_PORT_PAGEMATCH_EN</name>
                <description>Description: If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted, the port is continued to be granted if the following immediate commands are to the same memory page (i.e. same bank and same row). See also related PCCFG.pagematch_limit register.
Value After Reset: "(MEMC_DDR4_EN==1) ? 0x0 : 0x1"
Exists: Always</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_URGENT_EN</name>
                <description>Description: If set to 1, enables the AXI urgent sideband signal (arurgent). When enabled and arurgent is asserted by the master, that port becomes the highest priority and co_gs_go2critical_rd signal to DDRC is asserted if enabled in PCCFG.go2critical_en register. Note that arurgent signal can be asserted anytime and as long as required which is independent of address handshaking (it is not associated with any particular command).
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_AGING_EN</name>
                <description>Description: If set to 1, enables aging function for the read channel of the port.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RD_PORT_PRIORITY</name>
                <description>Description: Determines the initial load value of read aging counters. These counters will be parallel loaded after reset, or after each grant to the corresponding port. The aging counters down-count every clock cycle where the port is requesting but not granted. The higher significant 5-bits of the read aging counter sets the priority of the	read channel of a given port. Port's priority will increase as the higher significant 5-bits of the counter starts to decrease.
When the aging counter becomes 0, the corresponding port channel will have the highest priority level (timeout condition
- Priority0). For multi-port configurations, the aging counters cannot be used to set port priorities when external dynamic priority inputs (arqos) are enabled (timeout is still applicable). For single port configurations, the aging counters are only used when they timeout (become 0) to force read-write direction switching. In this case, external dynamic priority input, arqos (for reads only) can still be used to set the DDRC read priority (2 priority levels: low priority read - LPR, high priority read - HPR) on a command by command basis. Note: The two LSBs of this register field are tied internally to 2'b00.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>W</name>
            <description>Description: Port n Configuration Write Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00004000</resetValue>
            <resetMask>0x000073FF</resetMask>
            <fields>
              <field>
                <name>WR_PORT_PAGEMATCH_EN</name>
                <description>Description: If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted, the port is continued to be granted if the following immediate commands are to the same memory page (i.e. same bank and same row). See also related PCCFG.pagematch_limit register.
Value After Reset: 0x1
Exists: Always</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_URGENT_EN</name>
                <description>Description: If set to 1, enables the AXI urgent sideband signal (awurgent). When enabled and awurgent is asserted by the master, that port becomes the highest priority and co_gs_go2critical_wr signal to DDRC is asserted if enabled in PCCFG.go2critical_en register. Note that awurgent signal can be asserted anytime and as long as required which is independent of address handshaking (it is not associated with any particular command).
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_AGING_EN</name>
                <description>Description: If set to 1, enables aging function for the write channel of the port.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WR_PORT_PRIORITY</name>
                <description>Description: Determines the initial load value of write aging counters. These counters will be parallel loaded after reset, or after each grant to the corresponding port. The aging counters down-count every clock cycle where the port is requesting but not granted. The higher significant 5-bits of the write aging counter sets the initial priority of the
write channel of a given port. Port's priority will increase as the higher significant 5-bits of the counter starts to decrease. When the aging counter becomes 0, the corresponding port channel will have the highest priority level. For multi-port configurations, the aging counters cannot be used to set port priorities when external dynamic priority inputs (awqos) are enabled (timeout is still applicable). For single port configurations, the aging counters are only used when they timeout (become 0) to force read-write direction switching. Note: The two LSBs of this register field are tied internally to 2'b00.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>C</name>
            <description>Description: Port n Common Configuration Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>AHB_ENDIANNESS</name>
                <description>Description: If set to 0, enables support for little endian on the AHB port. If set to 1, enables support for big endian (BE- 32) on the AHB port. If set to 2, enables support for big endian (BE-A) on the AHB port.
Value After Reset: 0x0
Exists: UMCTL2_A_AHB_n==1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>16</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
            <name>ID[%s]</name>
            <description>no description available</description>
            <addressOffset>0xc</addressOffset>
            <register>
              <name>MASKCH</name>
              <description>Description: Port n Channel m Configuration ID Mask Register</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ID_MASK</name>
                  <description>Description: Determines the mask used in the ID mapping function for virtual channel m.
Value After Reset: 0x0
Exists: Always</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>VALUECH</name>
              <description>Description: Port n Channel m Configuration ID Value Register</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ID_VALUE</name>
                  <description>Description: Determines the value used in the ID mapping function for virtual channel m.
Value After Reset: 0x0
Exists: Always</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
